/*1.	Дан радиус окружности. 
Вычислить длину окружности и площадь круга.*/
// let r = +prompt('Введите радиус:');
// let c = 2*Math.PI*r;
// let s = Math.PI*r**2;
// alert(`Длина окружности: ${c.toFixed(2)} \nПлощадь круга:${s.toFixed(2)}`)


//Даны 2 катета прямоугольного треугольника. Найти гипотенузу и площадь треугольника.
// let a = +prompt("Введите катет а");
// let b = +prompt("Введите катет b");
// let gip = Math.sqrt(a**2+b**2);
// let s = (1/2)*a*b;
// alert(`гипотенузa: ${gip.toFixed(2)}\nплощадь: ${s.toFixed(2)}`)